// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "ファームウェアの\nアップデート";

// Errors
FileOpenError = "ファイル %@ を開くことができません";
FileOpenErrorExplanation = "ファイルが壊れているか、他の場所に移動されたか、名前が変更されたか、あるいは削除されている可能性があります。 ファイルの場所を確認するか他のファイルを選択して、もう一度試してください。";
PrintChannelOpenError = "プリンタ チャンネルを開くことができません";
PrintChannelOpenErrorExplanation = "プリンタが接続され電源が入っていることを確認し、もう一度試してください。";
SendDataError = "プリンタにデータを送信できません";
SendDataErrorExplanation = "プリンタが接続され電源が入っていることを確認し、もう一度試してください。";

SomePenErrorTitle = "ファームウェアをアップデートできません";
DoorOpenMsg = "カバーが開いているため、ファームウェアを更新できません。プリンタのカバーをすべて閉じてください。";

// Aquamarine Errors
FileCheckError = "ファームウェアをアップデートできません";
FileCheckErrorExplanation = "ファームウェアのパッケージが無効です。 別のファイルを選択して、もう一度試してください。";

OkButton = "Ok";
CancelButton = "キャンセル";
FirmwareUpdateTitle = "ファームウェアのアップデート";
FirmwareUpdateDeviceState = "印刷中";
FirmwareUpdateCancelingDeviceState = "キャンセル中";

// Great Wall Messages
PrinterIdleWarning = "プリンタが使用中の場合(たとえば、ジョブの印刷やキャリブレーション)、ファームウェアのアップデートは失敗する場合があります。\n\nファームウェアのアップデート処理を行う前に、プリンタが使用されていないことを確認してください。";
UpdateSuccessful = "ファームウェア ファイルのアップロードを行い、これからプリンタのアップデートを行うところです。\n\nファームウェアのアップデートを完了すると、プリンタは自動的に再起動します。";
InvalidPackage = "ファームウェア ファイルに問題があり、ファームウェアのアップデート処理は行われませんでした。 伝送エラーが原因の場合があります。\n\nもう一度ファームウェアのアップデート処理をやり直してください。\nそれでも問題が解決しない場合は、HPサポートに連絡してください。";
FailedDependencies = "ファームウェアのアップデート処理は、依存関係に問題があり、完了できませんでした。\n\n現在のファームウェアのバージョンは%@ですが、%@をインストールしようとしています。\n\n以下のウェブページを参照して、このプリンタの適切なアップデート パッケージを見つけてください。\n%@";
NotNow = "プリンタが使用中のため(たとえば、ジョブの処理または印刷)、ファームウェアのアップデートは行われませんでした。\n\nプリンタが使用されていないことを確認し、ファームウェアのアップデートをもう一度やり直してください。";
TransmissionError = "通信に問題が発生し、ファームウェアのアップデートが行われませんでした。\n\nプリンタの接続を確認し、ファームウェアのアップデートをもう一度やり直してください。";
LicenseNotAccepted = "ライセンスが承認されなかったので、ファームウェアのアップデートは行なわれていません。";
FatalError = "問題が発生し、ファームウェアのアップデート処理が行われませんでした。\n\n問題が解決しない場合は、HPサポートに連絡してください。";

// layout
TaskTitle = "ファームウェアのアップデート";
TaskDescription = "ファームウェアのアップデート用ファイルを選択し、プリンタに転送してください。";
FileNameTitle = "ファイル名：";
FileNameField = "<未選択>";
ChooseButton = "選択…";
UpdateButton = "アップデート";
ProgressPanel = "アップデート";
FirmwareUpdateProcessTitle = "アップデート中…";
